[
  {
    "title": "Why Furniture Insurance Isn’t Enough",
    "description": "Traditional furniture insurance is expensive, limited, and reactive. Discover why luxury homeowners are switching to FurnishCare — a preventive, subscription-based furniture care service that protects and preserves high-end furniture better than insurance.",
    "slug": "Why_Furniture_Insurance_is_not_Enough",
    "file": "/blogs/blog1.md"
  },
  {
    "title": "Luxury Furniture Deserves Better Than Insurance",
    "description": "Experience effortless, preventive maintenance that keeps your furniture flawless, beautiful, and built to last.",
    "slug": "Luxury_Furniture_Deserves_Better_Than_Insurance",
    "file": "/blogs/blog2.md"
  },
  {
    "title": "The Top 5 Reasons FurnishCare Outperforms Furniture Insurance",
    "description": "A proactive maintenance approach designed for discerning homeowners who want continuous protection, not claims and delays.",
    "slug": "The_Top_5_Reasons_FurnishCare_Outperforms_Furniture_Insurance",
    "file": "/blogs/blog3.md"
  },
  {
    "title": "Why Furniture Insurance Is Outdated",
    "description": "Traditional furniture insurance leaves costly gaps. Discover why modern homeowners are switching to subscription-based care with FurnishCare — for maintenance, repair, and peace of mind all year.",
    "slug": "Why_Furniture_Insurance_Is_Outdated",
    "file": "/blogs/blog4.md"
  },
  {
    "title": "The Ultimate Guide to Removing Scratches from Wood Furniture, And When DIY Just Isn’t Enough",
    "description": "Skip the messy “walnut tricks.” Learn which scratches you can fix at home — and when expert, invisible restoration is the only smart choice.",
    "slug": "When_DIY_Just_Isn’t_Enough",
    "file": "/blogs/blog5.md"
  },
  {
    "title": "Insurance or Subscription? The Only Furniture Protection That Actually Works",
    "description": "See how FurnishCare’s on-demand repairs outperform insurance deductibles, fine print, and claim delays — giving your furniture real protection where it matters most.",
    "slug": "Insurance_or_Subscription",
    "file": "/blogs/blog6.md"
  }
]

